{
  "alpha_pattern": {},
  "auto_mapping": null,
  "base_model_name_or_path": "/teamspace/studios/this_studio/prompt-optimization/models/lora_regression_head",
  "bias": "none",
  "corda_config": null,
  "eva_config": null,
  "exclude_modules": null,
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layer_replication": null,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 48,
  "lora_bias": false,
  "lora_dropout": 0.19419395757530922,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": null,
  "peft_type": "LORA",
  "r": 5,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "v_proj",
    "q_proj"
  ],
  "task_type": "FEATURE_EXTRACTION",
  "trainable_token_indices": null,
  "use_dora": false,
  "use_rslora": false
}